git_tutorials/git_refcard.tex
% Created 2013-03-10 Sun 11:18
\documentclass[]{article}
\usepackage[latin1]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{baskervald}
\usepackage{arydshln}
\usepackage{color}
\usepackage[margin=0.5in]{geometry}
\usepackage{multicol}
\providecommand{\alert}[1]{\textbf{#1}}

\title{my git reference card}
\author{}
\date{}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.8.11}}

\begin{document}

\maketitle

\thispagestyle{empty}
\pagestyle{empty}
%\setlength{\pdfpagewidth}{13in}
%\begin{multicols}{2}

\section*{Routine}
\label{sec-1}


\begin{center}
\begin{tabular}{llp{2.5in}}
 Task                 &  Command                                            &  Notes                                                                          \\
\hline
 Start new repo       &  \$ \texttt{git init}                               &  - just do this in the new directory                                            \\
                      &                                                     &  - don't nest repos!                                                            \\
 Check on things      &  \$ \texttt{git status}                             &  tells you what's up                                                            \\
                      &  \$ \texttt{git ls-files}                           &  shows files currently being tracked                                            \\
 Add stuff            &  \$ \texttt{git add <file>}                         &  instead of \texttt{<file>}, you can do:                                        \\
                      &                                                     &  - period to do \emph{everything}                                               \\
                      &                                                     &  - subfolder name to do everything in that folder                               \\
 Update stuff         &  same as adding                                     &  can use \texttt{git commit -a} to commit all changes to already-tracked files  \\
 Delete stuff         &  \$ \texttt{git rm <file>}                          &  need to do this even if file deleted using ``normal'' means                    \\
 Move stuff           &  \$ \texttt{git mv <file> <newlocation>}            &  same as \texttt{git add <newloc>} and \texttt{git rm}                          \\
 Rename stuff         &  same as moving!                                    &                                                                                 \\
 Commit changes       &  \$ \texttt{git commit}                             &  opens editor to commit message                                                 \\
 Commit with message  &  \$ \texttt{git commit -m} \texttt{"message here"}  &  adds message without opening editor                                            \\
\end{tabular}
\end{center}
\section*{Oops!}
\label{sec-2}


\begin{center}
\begin{tabular}{llp{2.5in}}
 Task                                       &  Command                               &  Notes                                                                                                                   \\
\hline
 Recover deleted file (unstaged)            &  \$ \texttt{git checkout -{}- <file>}  &  this works before the change is committed -- if \texttt{git status} tells you a file was deleted and you want it back!  \\
 Take changes (adds or rms) out of staging  &  \$ \texttt{git reset HEAD <file>}     &  this takes changes from the ``staging'' area, but does not undo the changes!                                            \\
 Messed up recent \texttt{commit}           &  \$ \texttt{git commit -{}-amend}      &  \emph{after} doing some more adds/rms (or just with a new message), updates previous commit with new stuff              \\
                                            &                                        &  \href{http://git-scm.com/book/en/Git-Basics-Undoing-Things}{see here for some details}                                  \\
\end{tabular}
\end{center}
\section*{Dealing with history}
\label{sec-3}


\begin{center}
\begin{tabular}{llp{2.5in}}
 Task                           &  Command                                             &  Notes                                                                                                                                                                  \\
\hline
 Peek at history                &  \$ \texttt{git log}                                 &  hit ``q'' to get back to regular prompt                                                                                                                                \\
                                &  \$ \texttt{git log -{}-pretty=oneline}              &  more condensed view                                                                                                                                                    \\
                                &  \$ \texttt{git log --pretty=format:"\%h \%ad \%s"}  &  REALLY HANDY view! Use \texttt{\%ar} for ``relative'' date, or \texttt{--date=short} for just dates, etc.                                                              \\
                                &  \$ \texttt{git log -{}-since=<time>}                &  lots of options for \texttt{<time>}                                                                                                                                    \\
                                &                                                      &  - \texttt{"yesterday"}, \texttt{"1 week ago"}, \texttt{1.week} or \texttt{"1.week"}, \texttt{"2013-01-30"}, \texttt{"10 minutes ago"}, \texttt{"last Tuesday"}, etc.!  \\
                                &                                                      &  \href{http://www.alexpeattie.com/blog/working-with-dates-in-git/}{see here for some more details}                                                                      \\
 History of just one file       &  \$ \texttt{git log <file>}                          &  only shows commits that affected \texttt{<file>}                                                                                                                       \\
 Show history with dates/times  &  \$ \texttt{git log}                                 &                                                                                                                                                                         \\
 ``Rewind'' temporarily         &  \$ \texttt{git checkout <hash>}                     &  the \texttt{<hash>} is (at least) the first several characters of the long SHA1 hash code ``address'' for a particular commit you want to rewind to                    \\
                                &                                                      &  NOTE: must first have a clean (committed) working branch (e.g., ``master'')                                                                                            \\
 Go back to the current state   &  \$ \texttt{git checkout master}                     &  After you're done messing around with the ``rewind''                                                                                                                   \\
\end{tabular}
\end{center}



  
%\end{multicols}

\end{document}
